package ru.java.courses;

public class Lesson5_Strings {

    /**
     * Дан массив строк, необходимо удалить из него все дубли,
     * оставшиеся строки объединить в одну в порядке следования в массиве.
     *
     * <p>
     * Подсказка: массив может быть пустой
     *
     * @param strings массив строк
     *
     * @return полученную строку.
     */
    public static String task1(String[] strings) {
        return null;
    }

    /**
     * Дан массив пар названий книг и авторов, необходимо привести каждую пару в строку вида:
     * “Название книги” И.И.Автора
     * <p>
     * Подсказка: Кавычек может не быть, а вместо инициалов полное имя
     *
     * @param pairs массив из пар строк
     *
     * @return  массив из полученных строк отсортированный по названию книг по алфавиту.
     */
    public static String[] task2(String[][] pairs) {
        return null;
    }

    /**
     * Дана строка, необходимо найти два символа и вернуть подстроку между ними.
     * <p>
     * Подсказка: одного или обоих символов может нет быть
     *
     * @param str исходная строка
     * @param symb1 первый символ
     * @param symb2 второй символ
     *
     * @return подстроку между найденными символами
     */
    public static String task3(String str, char symb1, char symb2) {
        return null;
    }
}
