package ru.homework.service;

import java.util.List;

public class PhoneNumberService {

    /**
     * Данный метод должен вернуть найденные и исправленные в нужный формат телефонные номера.
     * Возвращать нужно найденные и исправленные номера в формате списка String.
     * <p>
     * В ходе реализации можно создавать такую иерархию классов и пакетов, какая будет удобна Вам.
     * Главное вернуть итоговый результат списка в данном методе.
     * <p>
     * Более подробную инстукцию к заданию смотрите в файле READ.ME в корневой папке.
     *
     * @return List<String> - где список содержит номера в формате "+7 (xxx) xxx-xxxx"</>
     */
    public static List<String> findAllActualPhoneNumbers() {
        return null;
    }
}